Ran Plan for dir: `eks/dev/apne2/eks` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
!       ami                                  = "ami-0557d60e6a01a934f" -> "ami-07a2318163330ee84" # forces replacement
!       arn                                  = "arn:aws:ec2:ap-northeast-2:357836924303:instance/i-011682094d4b3f71f" -> (known after apply)
!       associate_public_ip_address          = true -> (known after apply)
!       availability_zone                    = "ap-northeast-2a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 1 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
+       enable_primary_ipv6                  = (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
!       id                                   = "i-011682094d4b3f71f" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-054f504acf1673eb0" -> (known after apply)
!       private_dns                          = "ip-10-0-1-166.ap-northeast-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.1.166" -> (known after apply)
!       public_dns                           = "ec2-54-180-133-77.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
!       public_ip                            = "54.180.133.77" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "bastion"
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

!       capacity_reservation_specification (known after apply)
-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

!       cpu_options (known after apply)
-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

-       credit_specification {
-           cpu_credits = "standard" -> null
        }

!       ebs_block_device (known after apply)

!       enclave_options (known after apply)
-       enclave_options {
-           enabled = false -> null
        }

!       ephemeral_block_device (known after apply)

!       instance_market_options (known after apply)

!       maintenance_options (known after apply)
-       maintenance_options {
-           auto_recovery = "default" -> null
        }

!       metadata_options (known after apply)
-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_protocol_ipv6          = "disabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
-           instance_metadata_tags      = "disabled" -> null
        }

!       network_interface (known after apply)

!       private_dns_name_options (known after apply)
-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

!       root_block_device (known after apply)
-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/xvda" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {
-               "Environment" = "dev"
-               "ManagedBy"   = "Terraform"
-               "Project"     = "cacoabank"
            } -> null
-           tags_all              = {
-               "Environment" = "dev"
-               "ManagedBy"   = "Terraform"
-               "Project"     = "cacoabank"
            } -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-09c3377223e867471" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # local_file.key will be created
+ resource "local_file" "key" {
+       content              = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0600"
+       filename             = "./dev-cacoabank-keypair.pem"
+       id                   = (known after apply)
    }

  # module.addons.aws_eks_addon.this["eks-pod-identity-agent"] will be created
+ resource "aws_eks_addon" "this" {
+       addon_name           = "eks-pod-identity-agent"
+       addon_version        = "v1.3.4-eksbuild.1"
+       arn                  = (known after apply)
+       cluster_name         = "dev-cacoabank-cluster"
+       configuration_values = (known after apply)
+       created_at           = (known after apply)
+       id                   = (known after apply)
+       modified_at          = (known after apply)
+       tags_all             = {
+           "Environment" = "dev"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "cacoabank"
        }

+       timeouts {}
    }

  # module.cluster.aws_eks_cluster.this[0] will be updated in-place
! resource "aws_eks_cluster" "this" {
        id                            = "dev-cacoabank-cluster"
        name                          = "dev-cacoabank-cluster"
        tags                          = {}
        # (12 unchanged attributes hidden)

!       vpc_config {
!           public_access_cidrs       = [
-               "125.133.32.199/32",
-               "132.226.226.25/32",
-               "211.107.49.36/32",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.private_nodegroup.data.aws_ami.launch_template_ami will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ami" "launch_template_ami" {
+       architecture          = (known after apply)
+       arn                   = (known after apply)
+       block_device_mappings = (known after apply)
+       boot_mode             = (known after apply)
+       creation_date         = (known after apply)
+       deprecation_time      = (known after apply)
+       description           = (known after apply)
+       ena_support           = (known after apply)
+       hypervisor            = (known after apply)
+       id                    = (known after apply)
+       image_id              = (known after apply)
+       image_location        = (known after apply)
+       image_owner_alias     = (known after apply)
+       image_type            = (known after apply)
+       imds_support          = (known after apply)
+       kernel_id             = (known after apply)
+       most_recent           = true
+       name                  = (known after apply)
+       owner_id              = (known after apply)
+       owners                = [
+           "602401143452",
        ]
+       platform              = (known after apply)
+       platform_details      = (known after apply)
+       product_codes         = (known after apply)
+       public                = (known after apply)
+       ramdisk_id            = (known after apply)
+       root_device_name      = (known after apply)
+       root_device_type      = (known after apply)
+       root_snapshot_id      = (known after apply)
+       sriov_net_support     = (known after apply)
+       state                 = (known after apply)
+       state_reason          = (known after apply)
+       tags                  = (known after apply)
+       tpm_support           = (known after apply)
+       usage_operation       = (known after apply)
+       virtualization_type   = (known after apply)

+       filter {
+           name   = "name"
+           values = [
+               (known after apply),
            ]
        }
    }

  # module.private_nodegroup.data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
+       access_config             = (known after apply)
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       compute_config            = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = "dev-cacoabank-cluster"
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       remote_network_config     = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       storage_config            = (known after apply)
+       tags                      = (known after apply)
+       upgrade_policy            = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
+       zonal_shift_config        = (known after apply)
    }

  # module.private_nodegroup.data.aws_iam_policy.SSMManagedInstanceCore will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "SSMManagedInstanceCore" {
+       arn              = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       attachment_count = (known after apply)
+       description      = (known after apply)
+       id               = (known after apply)
+       name             = (known after apply)
+       path             = (known after apply)
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = (known after apply)
    }

  # module.private_nodegroup.aws_eks_node_group.nodegroup will be updated in-place
! resource "aws_eks_node_group" "nodegroup" {
        id                     = "dev-cacoabank-cluster:dev-cacoabank-private-nodegroup"
        tags                   = {
            "Name" = "dev-cacoabank-private-nodegroup"
        }
        # (16 unchanged attributes hidden)

!       launch_template {
            id      = "lt-09e989ffa242d791f"
            name    = "dev-cacoabank-cluster-dev-cacoabank-private-nodegroup-lt"
!           version = "1" -> (known after apply)
        }

!       scaling_config {
!           max_size     = 15 -> 10
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.private_nodegroup.aws_launch_template.eks_template will be updated in-place
! resource "aws_launch_template" "eks_template" {
!       default_version                      = 1 -> (known after apply)
        id                                   = "lt-09e989ffa242d791f"
!       image_id                             = "ami-0af1ec5696c690cc7" -> (known after apply)
!       latest_version                       = 1 -> (known after apply)
        name                                 = "dev-cacoabank-cluster-dev-cacoabank-private-nodegroup-lt"
        tags                                 = {}
!       user_data                            = "IyEvYmluL2Jhc2gKc2V0IC1leAoKIyBrdWJlbGV0IOyYpOuyhOudvOydtOuTnCBKU09OIOyggeyaqQojIGt1YmVsZXRfb3ZlcnJpZGVzX2pzb24g67OA7IiY6rCAICJ7fSLqsIAg7JWE64uI652866m0LCDtlbTri7kg64K07Jqp7J2EIOq4sOyhtCBrdWJlbGV0LWNvbmZpZy5qc29u7JeQIG1lcmdlCmlmIFsgInt9IiAhPSAie30iIF07IHRoZW4KICAgIHl1bSBpbnN0YWxsIC15IGpxCiAgICBlY2hvICd7fScgPiAvdG1wL2t1YmVsZXQtb3ZlcnJpZGVzLmpzb24KICAgIGpxIC1zICcuWzBdICogLlsxXScgL2V0Yy9rdWJlcm5ldGVzL2t1YmVsZXQva3ViZWxldC1jb25maWcuanNvbiAvdG1wL2t1YmVsZXQtb3ZlcnJpZGVzLmpzb24gPiAvZXRjL2t1YmVybmV0ZXMva3ViZWxldC9rdWJlbGV0LWNvbmZpZy1tZXJnZWQuanNvbgogICAgbXYgL2V0Yy9rdWJlcm5ldGVzL2t1YmVsZXQva3ViZWxldC1jb25maWctbWVyZ2VkLmpzb24gL2V0Yy9rdWJlcm5ldGVzL2t1YmVsZXQva3ViZWxldC1jb25maWcuanNvbgpmaQoKeXVtIHVwZGF0ZSAteSAmJiB5dW0gaW5zdGFsbCB2aW0gd2dldCBjdXJsIC15CgojIGJvb3RzdHJhcCDsi6TtlokgKGt1YmVsZXQg7ISk7KCVIOuwmOyYgeydgCAvZXRjL2Vrcy9ib290c3RyYXAuc2gg7Iuk7ZaJIOyLnCDsnpDrj5kg67CY7JiBKQojIGt1YmVsZXQtZXh0cmEtYXJnc+uKlCDtlYTsmpTsi5wg7LaU6rCAIOqwgOuKpS4g7JiIOiAtLWt1YmVsZXQtZXh0cmEtYXJncyAnLS1ub2RlLWxhYmVscz0uLi4nCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAnZGV2LWNhY29hYmFuay1jbHVzdGVyJyBcCiAgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vNzZGRTIxMTFCODJBNUQ4OTk4MDg4MUM3QkJERTYxNTUueWw0LmFwLW5vcnRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyBcCiAgLS1iNjQtY2x1c3Rlci1jYSAnTFMwdExTMUNSVWRKVGlCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2sxSlNVUkNWRU5EUVdVeVowRjNTVUpCWjBsSll5OTBSV0ZqVFdGa0swRjNSRkZaU2t0dldrbG9kbU5PUVZGRlRFSlJRWGRHVkVWVVRVSkZSMEV4VlVVS1FYaE5TMkV6Vm1sYVdFcDFXbGhTYkdONlFXVkdkekI1VGtSRmVVMVVaM2hPUkUwMVRsUk9ZVVozTUhwT1JFVjVUVlJaZUU1RVVUQk9WRTVoVFVKVmVBcEZla0ZTUW1kT1ZrSkJUVlJEYlhReFdXMVdlV0p0VmpCYVdFMTNaMmRGYVUxQk1FZERVM0ZIVTBsaU0wUlJSVUpCVVZWQlFUUkpRa1IzUVhkblowVkxDa0Z2U1VKQlVVUkJjWEEzU1Zndk0wMTZMMVpVVkZsUVFXNVdka3RFWm5SRWJGSmxlRTE2UTFkcWNUSmpNekZ4TWpNdlMySnlSMjlGYVV0S1ptVXJiMHNLVjA5RmFVbEVWVWszWm5GdFNTODVSM1JzVVRsWFRYUktVVXhPY0dscFdtZFlaazlHT1ZoeEx6UkZVa0pTYzIwNWFsUkhjRU5PWnl0cmVuTkplRXdyU3dwUlZGVllOa1UxTXpaQmJXeHJkemRSVFhwTmFXRkxOSE5TVTJsSk5XRnVTbkEyZUc1bU9WWjRiMUZ6ZFd0dUswNWlVRFpxT1d3Mk9GTkpaMGQxZUhrckNsVTVTMmN4YlZSb1J6Sk5kRnBDT1c5b04zUXZSV0pUY0VONlZFRmtha1p6T1RaSFJsUlhkbXQ0ZEdObldFeElTREEzUmtGNGVsQlRNSEZRYWtadmQwRUtTa2sxUTJKamVHSm1kVk5NVG5KeFZYUjBURVZ5UTBWemFqQnhTVlJoWXpZcmRHeG1LMHRrYnpSTVJqUjNSVkpLY25oVE5rZEdhVEJpZUV4S05sZFZhd3BtUWxKeVdqY3pTbk00YTFsaVltbFJXWHAxV0ZCQk5USXdVRGw2UVdkTlFrRkJSMnBYVkVKWVRVRTBSMEV4VldSRWQwVkNMM2RSUlVGM1NVTndSRUZRQ2tKblRsWklVazFDUVdZNFJVSlVRVVJCVVVndlRVSXdSMEV4VldSRVoxRlhRa0pSY2pOdlJHNUZXVFY1WWtsbVlrRlJWak5aVG5aMGFYaHBXa0o2UVZZS1FtZE9Wa2hTUlVWRWFrRk5aMmR3Y21SWFNteGpiVFZzWkVkV2VrMUJNRWREVTNGSFUwbGlNMFJSUlVKRGQxVkJRVFJKUWtGUlEzUXllV2xtVkVGb2JRcEdOMnBQY0N0U1IwaFFaRVZtVlZoUk9XRnhkemRqY1V4UVZHTnJVRkZ0VGtGT00zSm5UR05GTmtkWk5YVjJZbEJIUmtWbGJFeFRNRkJGY1dkdlVGWndDblk1UlRGcVJreHNjRTlrV21JelZFRmpORU5pV1ZGak1VcEhUMUZqUmtnNWMzZ3hVRGR5YVVRNGRWVldUWE4xUjFScGVGZDBUV2xPVDJGWlMyUXlPV1lLWld4dFZISllia2hvT1VSbUx6ZENSREphZGtjMWRDOTRNR0ZzYW5oaE1HeE9UWGd2TjNkb2RtbFdiRU15TURKME0yaENTazgzSzNwdGVVWkVlR1p5VUFwVllWRXhMMUZQVWl0NU1rUm5iMkZpYUdkdk1GRTJWbTFKY1U5dkwyMXpVRkJaUjJwV2IyZzRZM0oyWkRsVFRVbEpXSGw0ZFhCWFNGVTVRekpwY0ROTENrcExWVmxZU3l0c1NEWXhjMDU1WjAxM1UydHBRelJEUlZjdlNFaGlMMFpZUVhrMVdtcFBjRll5VlZKclRtZHllRlpXTkZkdk0wOXNjRTVoY25KdE1XOEtVRlZHZVV0bWMzWjFTMlZ0Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLJwo=" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eks/dev/apne2/eks
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.juneman.click/lock?id=changhyuni%252Fexamples%252Feks%252Fdev%252Fapne2%252Feks%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eks/dev/apne2/eks
  ```
Plan: 3 to add, 3 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```